{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "pwd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>product_id</th>\n",
       "      <th>product_name</th>\n",
       "      <th>product_description</th>\n",
       "      <th>product_currentprice</th>\n",
       "      <th>product_discount</th>\n",
       "      <th>product_actualprice</th>\n",
       "      <th>product_category</th>\n",
       "      <th>product_image</th>\n",
       "      <th>product_manufacturer</th>\n",
       "      <th>inventory</th>\n",
       "      <th>store_zipcode</th>\n",
       "      <th>rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Sunflower Seed Raw</td>\n",
       "      <td>Carroway Seed</td>\n",
       "      <td>242.47</td>\n",
       "      <td>9</td>\n",
       "      <td>442</td>\n",
       "      <td>food</td>\n",
       "      <td>images/food/1.png</td>\n",
       "      <td>Aufderhar-Schoen</td>\n",
       "      <td>73</td>\n",
       "      <td>60601</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Sauce - Salsa</td>\n",
       "      <td>Lamb - Sausage Casings</td>\n",
       "      <td>96.20</td>\n",
       "      <td>2</td>\n",
       "      <td>486</td>\n",
       "      <td>food</td>\n",
       "      <td>images/food/2.jpg</td>\n",
       "      <td>Durgan and Sons</td>\n",
       "      <td>9</td>\n",
       "      <td>41687</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>4</td>\n",
       "      <td>Motts Apple Juice</td>\n",
       "      <td>Fresh Juice</td>\n",
       "      <td>151.89</td>\n",
       "      <td>9</td>\n",
       "      <td>282</td>\n",
       "      <td>food</td>\n",
       "      <td>images/food/4.jpg</td>\n",
       "      <td>D'Amore LLC</td>\n",
       "      <td>85</td>\n",
       "      <td>60235</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>5</td>\n",
       "      <td>Trout - Rainbow, Fresh</td>\n",
       "      <td>Sun - Dried Tomatoes</td>\n",
       "      <td>264.25</td>\n",
       "      <td>9</td>\n",
       "      <td>438</td>\n",
       "      <td>food</td>\n",
       "      <td>images/food/5.jpg</td>\n",
       "      <td>Treutel-Baumbach</td>\n",
       "      <td>53</td>\n",
       "      <td>85236</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>6</td>\n",
       "      <td>Lamb - Rack</td>\n",
       "      <td>Compound - Orange</td>\n",
       "      <td>103.54</td>\n",
       "      <td>1</td>\n",
       "      <td>314</td>\n",
       "      <td>food</td>\n",
       "      <td>images/food/6.webp</td>\n",
       "      <td>Braun-Hansen</td>\n",
       "      <td>56</td>\n",
       "      <td>49652</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   product_id            product_name     product_description  \\\n",
       "0           1      Sunflower Seed Raw           Carroway Seed   \n",
       "1           2           Sauce - Salsa  Lamb - Sausage Casings   \n",
       "2           4       Motts Apple Juice             Fresh Juice   \n",
       "3           5  Trout - Rainbow, Fresh    Sun - Dried Tomatoes   \n",
       "4           6             Lamb - Rack       Compound - Orange   \n",
       "\n",
       "   product_currentprice  product_discount  product_actualprice  \\\n",
       "0                242.47                 9                  442   \n",
       "1                 96.20                 2                  486   \n",
       "2                151.89                 9                  282   \n",
       "3                264.25                 9                  438   \n",
       "4                103.54                 1                  314   \n",
       "\n",
       "  product_category       product_image product_manufacturer  inventory  \\\n",
       "0             food   images/food/1.png     Aufderhar-Schoen         73   \n",
       "1             food   images/food/2.jpg      Durgan and Sons          9   \n",
       "2             food   images/food/4.jpg          D'Amore LLC         85   \n",
       "3             food   images/food/5.jpg     Treutel-Baumbach         53   \n",
       "4             food  images/food/6.webp         Braun-Hansen         56   \n",
       "\n",
       "   store_zipcode  rating  \n",
       "0          60601       5  \n",
       "1          41687       5  \n",
       "2          60235       5  \n",
       "3          85236       5  \n",
       "4          49652       5  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data = pd.read_csv(r\"C:\\\\Users\\ms811\\\\Desktop\\\\groceryhub\\\\groceryhub.csv\", encoding=\"ISO-8859-1\")\n",
    "data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>product_id</th>\n",
       "      <th>product_name</th>\n",
       "      <th>product_description</th>\n",
       "      <th>product_currentprice</th>\n",
       "      <th>product_discount</th>\n",
       "      <th>product_actualprice</th>\n",
       "      <th>product_category</th>\n",
       "      <th>product_image</th>\n",
       "      <th>product_manufacturer</th>\n",
       "      <th>inventory</th>\n",
       "      <th>store_zipcode</th>\n",
       "      <th>rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>137</th>\n",
       "      <td>141</td>\n",
       "      <td>Seventh Generation</td>\n",
       "      <td>Kitchen Cleaner</td>\n",
       "      <td>70.00</td>\n",
       "      <td>10</td>\n",
       "      <td>63</td>\n",
       "      <td>household</td>\n",
       "      <td>/images/household/26.jpg</td>\n",
       "      <td>Welch-Sporer</td>\n",
       "      <td>40</td>\n",
       "      <td>75632</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>138</th>\n",
       "      <td>142</td>\n",
       "      <td>Oxiclean</td>\n",
       "      <td>Washingmachine Cleaner</td>\n",
       "      <td>12.00</td>\n",
       "      <td>0</td>\n",
       "      <td>12</td>\n",
       "      <td>household</td>\n",
       "      <td>/images/household/27.jpg</td>\n",
       "      <td>Hills-Sauer</td>\n",
       "      <td>77</td>\n",
       "      <td>15489</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>139</th>\n",
       "      <td>143</td>\n",
       "      <td>Simple Green</td>\n",
       "      <td>Industrial Cleaner</td>\n",
       "      <td>10.00</td>\n",
       "      <td>0</td>\n",
       "      <td>10</td>\n",
       "      <td>household</td>\n",
       "      <td>/images/household/28.jpg</td>\n",
       "      <td>Mante-Spinka</td>\n",
       "      <td>23</td>\n",
       "      <td>95478</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>140</th>\n",
       "      <td>144</td>\n",
       "      <td>Windex</td>\n",
       "      <td>Window Cleaner</td>\n",
       "      <td>5.00</td>\n",
       "      <td>5</td>\n",
       "      <td>5</td>\n",
       "      <td>household</td>\n",
       "      <td>/images/household/29.jpg</td>\n",
       "      <td>Pagac, Walsh and Friesen</td>\n",
       "      <td>77</td>\n",
       "      <td>84268</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>141</th>\n",
       "      <td>146</td>\n",
       "      <td>Sunflower Seed Raw</td>\n",
       "      <td>Carroway Seed</td>\n",
       "      <td>241.47</td>\n",
       "      <td>9</td>\n",
       "      <td>441</td>\n",
       "      <td>food</td>\n",
       "      <td>images/food/1.png</td>\n",
       "      <td>Aufderhar-Schoen</td>\n",
       "      <td>73</td>\n",
       "      <td>60616</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     product_id        product_name     product_description  \\\n",
       "137         141  Seventh Generation         Kitchen Cleaner   \n",
       "138         142            Oxiclean  Washingmachine Cleaner   \n",
       "139         143        Simple Green      Industrial Cleaner   \n",
       "140         144              Windex          Window Cleaner   \n",
       "141         146  Sunflower Seed Raw           Carroway Seed   \n",
       "\n",
       "     product_currentprice  product_discount  product_actualprice  \\\n",
       "137                 70.00                10                   63   \n",
       "138                 12.00                 0                   12   \n",
       "139                 10.00                 0                   10   \n",
       "140                  5.00                 5                    5   \n",
       "141                241.47                 9                  441   \n",
       "\n",
       "    product_category             product_image      product_manufacturer  \\\n",
       "137        household  /images/household/26.jpg              Welch-Sporer   \n",
       "138        household  /images/household/27.jpg               Hills-Sauer   \n",
       "139        household  /images/household/28.jpg              Mante-Spinka   \n",
       "140        household  /images/household/29.jpg  Pagac, Walsh and Friesen   \n",
       "141             food         images/food/1.png          Aufderhar-Schoen   \n",
       "\n",
       "     inventory  store_zipcode  rating  \n",
       "137         40          75632       5  \n",
       "138         77          15489       5  \n",
       "139         23          95478       5  \n",
       "140         77          84268       5  \n",
       "141         73          60616       5  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data = pd.read_csv(r\"C:\\\\Users\\ms811\\\\Desktop\\\\groceryhub\\\\groceryhub.csv\", encoding=\"ISO-8859-1\")\n",
    "data.tail()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userId</th>\n",
       "      <th>customerName</th>\n",
       "      <th>email</th>\n",
       "      <th>userAddress</th>\n",
       "      <th>creditCardNo</th>\n",
       "      <th>discount</th>\n",
       "      <th>orderId</th>\n",
       "      <th>orderTime</th>\n",
       "      <th>shippingDate</th>\n",
       "      <th>orderName</th>\n",
       "      <th>category</th>\n",
       "      <th>orderPrice</th>\n",
       "      <th>storeId</th>\n",
       "      <th>storeAddress</th>\n",
       "      <th>zipcode</th>\n",
       "      <th>deliveredOnTime</th>\n",
       "      <th>transactionStatus</th>\n",
       "      <th>review</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>839</td>\n",
       "      <td>Sainath Macharla</td>\n",
       "      <td>asdfgh@qwerty.com</td>\n",
       "      <td>2951 S King Drive, Chicago, IL, 60616</td>\n",
       "      <td>1234567890</td>\n",
       "      <td>8.0</td>\n",
       "      <td>33</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Bar Special K</td>\n",
       "      <td>food</td>\n",
       "      <td>104.80</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>60616</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Disputed</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>77</td>\n",
       "      <td>Sainath Macharla</td>\n",
       "      <td>ms811@live.com</td>\n",
       "      <td>2951 S King Drive, Chicago, IL, 60616</td>\n",
       "      <td>1234567890</td>\n",
       "      <td>2.0</td>\n",
       "      <td>24</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Petite Baguette</td>\n",
       "      <td>food</td>\n",
       "      <td>122.17</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>60616</td>\n",
       "      <td>No</td>\n",
       "      <td>Disputed</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>305</td>\n",
       "      <td>Usain Bolt</td>\n",
       "      <td>wsdth@fewaq.com</td>\n",
       "      <td>9867 Dartmouth, Austin, Texas, 78702</td>\n",
       "      <td>1234567891</td>\n",
       "      <td>2.0</td>\n",
       "      <td>25</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Gatorade</td>\n",
       "      <td>beverages</td>\n",
       "      <td>20.69</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>78702</td>\n",
       "      <td>No</td>\n",
       "      <td>Approved</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>305</td>\n",
       "      <td>Usain Bolt</td>\n",
       "      <td>wsdth@fewaq.com</td>\n",
       "      <td>9867 Dartmouth, Austin, Texas, 78702</td>\n",
       "      <td>1234567891</td>\n",
       "      <td>0.0</td>\n",
       "      <td>25</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Runa</td>\n",
       "      <td>beverages</td>\n",
       "      <td>73.35</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>78702</td>\n",
       "      <td>No</td>\n",
       "      <td>Approved</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>305</td>\n",
       "      <td>Usain Bolt</td>\n",
       "      <td>wsdth@fewaq.com</td>\n",
       "      <td>9867 Dartmouth, Austin, Texas, 78702</td>\n",
       "      <td>1234567891</td>\n",
       "      <td>9.0</td>\n",
       "      <td>25</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Gherkin</td>\n",
       "      <td>food</td>\n",
       "      <td>32.76</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>78702</td>\n",
       "      <td>No</td>\n",
       "      <td>Approved</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   userId      customerName              email  \\\n",
       "0     839  Sainath Macharla  asdfgh@qwerty.com   \n",
       "1      77  Sainath Macharla     ms811@live.com   \n",
       "2     305        Usain Bolt    wsdth@fewaq.com   \n",
       "3     305        Usain Bolt    wsdth@fewaq.com   \n",
       "4     305        Usain Bolt    wsdth@fewaq.com   \n",
       "\n",
       "                             userAddress  creditCardNo  discount  orderId  \\\n",
       "0  2951 S King Drive, Chicago, IL, 60616    1234567890       8.0       33   \n",
       "1  2951 S King Drive, Chicago, IL, 60616    1234567890       2.0       24   \n",
       "2   9867 Dartmouth, Austin, Texas, 78702    1234567891       2.0       25   \n",
       "3   9867 Dartmouth, Austin, Texas, 78702    1234567891       0.0       25   \n",
       "4   9867 Dartmouth, Austin, Texas, 78702    1234567891       9.0       25   \n",
       "\n",
       "    orderTime shippingDate        orderName   category  orderPrice  \\\n",
       "0  2020-12-03   2020-12-17    Bar Special K       food      104.80   \n",
       "1  2020-12-03   2020-12-17  Petite Baguette       food      122.17   \n",
       "2  2020-12-03   2020-12-17         Gatorade  beverages       20.69   \n",
       "3  2020-12-03   2020-12-17             Runa  beverages       73.35   \n",
       "4  2020-12-03   2020-12-17          Gherkin       food       32.76   \n",
       "\n",
       "        storeId  storeAddress  zipcode deliveredOnTime transactionStatus  \\\n",
       "0  homedelivery  homedelivery    60616             Yes          Disputed   \n",
       "1  homedelivery  homedelivery    60616              No          Disputed   \n",
       "2  homedelivery  homedelivery    78702              No          Approved   \n",
       "3  homedelivery  homedelivery    78702              No          Approved   \n",
       "4  homedelivery  homedelivery    78702              No          Approved   \n",
       "\n",
       "   review  \n",
       "0       1  \n",
       "1       3  \n",
       "2       2  \n",
       "3       2  \n",
       "4       2  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data = pd.read_csv(r\"C:\\\\Users\\\\ms811\\\\Desktop\\\\groceryhub\\\\customerorders.csv\",encoding=\"ISO-8859-1\")\n",
    "data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userId</th>\n",
       "      <th>customerName</th>\n",
       "      <th>email</th>\n",
       "      <th>userAddress</th>\n",
       "      <th>creditCardNo</th>\n",
       "      <th>discount</th>\n",
       "      <th>orderId</th>\n",
       "      <th>orderTime</th>\n",
       "      <th>shippingDate</th>\n",
       "      <th>orderName</th>\n",
       "      <th>category</th>\n",
       "      <th>orderPrice</th>\n",
       "      <th>storeId</th>\n",
       "      <th>storeAddress</th>\n",
       "      <th>zipcode</th>\n",
       "      <th>deliveredOnTime</th>\n",
       "      <th>transactionStatus</th>\n",
       "      <th>review</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>146</td>\n",
       "      <td>Lance Armstrong</td>\n",
       "      <td>irtyfh@lkshs.com</td>\n",
       "      <td>301 Ulter, Cheyenne, Wyoming, 82002</td>\n",
       "      <td>2254301681</td>\n",
       "      <td>7.0</td>\n",
       "      <td>30</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Pureleaf</td>\n",
       "      <td>beverages</td>\n",
       "      <td>152.89</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>82002</td>\n",
       "      <td>No</td>\n",
       "      <td>Approved</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>146</td>\n",
       "      <td>Lance Armstrong</td>\n",
       "      <td>irtyfh@lkshs.com</td>\n",
       "      <td>301 Ulter, Cheyenne, Wyoming, 82002</td>\n",
       "      <td>2254301681</td>\n",
       "      <td>2.0</td>\n",
       "      <td>30</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Sauce - Salsa</td>\n",
       "      <td>food</td>\n",
       "      <td>96.20</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>82002</td>\n",
       "      <td>No</td>\n",
       "      <td>Approved</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>94</td>\n",
       "      <td>Kristen Stewart</td>\n",
       "      <td>igfmgh@hajd.com</td>\n",
       "      <td>95 Wendell, Bismarck, N Dakota, 58505</td>\n",
       "      <td>4169032478</td>\n",
       "      <td>8.0</td>\n",
       "      <td>13</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Steampan - Foil</td>\n",
       "      <td>food</td>\n",
       "      <td>115.69</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>58505</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Disputed</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>367</td>\n",
       "      <td>Peter Parker</td>\n",
       "      <td>lhhske@hasgej.com</td>\n",
       "      <td>20 Ingram, New York, New York, 11375</td>\n",
       "      <td>5230162784</td>\n",
       "      <td>5.0</td>\n",
       "      <td>35</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Rockstar</td>\n",
       "      <td>beverages</td>\n",
       "      <td>118.08</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>11375</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Approved</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>367</td>\n",
       "      <td>Peter Parker</td>\n",
       "      <td>lhhske@hasgej.com</td>\n",
       "      <td>20 Ingram, New York, New York, 11375</td>\n",
       "      <td>5230162784</td>\n",
       "      <td>5.0</td>\n",
       "      <td>35</td>\n",
       "      <td>2020-12-03</td>\n",
       "      <td>2020-12-17</td>\n",
       "      <td>Spellagrino</td>\n",
       "      <td>beverages</td>\n",
       "      <td>187.82</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>homedelivery</td>\n",
       "      <td>11375</td>\n",
       "      <td>Yes</td>\n",
       "      <td>Approved</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    userId     customerName              email  \\\n",
       "44     146  Lance Armstrong   irtyfh@lkshs.com   \n",
       "45     146  Lance Armstrong   irtyfh@lkshs.com   \n",
       "46      94  Kristen Stewart    igfmgh@hajd.com   \n",
       "47     367     Peter Parker  lhhske@hasgej.com   \n",
       "48     367     Peter Parker  lhhske@hasgej.com   \n",
       "\n",
       "                              userAddress  creditCardNo  discount  orderId  \\\n",
       "44    301 Ulter, Cheyenne, Wyoming, 82002    2254301681       7.0       30   \n",
       "45    301 Ulter, Cheyenne, Wyoming, 82002    2254301681       2.0       30   \n",
       "46  95 Wendell, Bismarck, N Dakota, 58505    4169032478       8.0       13   \n",
       "47   20 Ingram, New York, New York, 11375    5230162784       5.0       35   \n",
       "48   20 Ingram, New York, New York, 11375    5230162784       5.0       35   \n",
       "\n",
       "     orderTime shippingDate        orderName   category  orderPrice  \\\n",
       "44  2020-12-03   2020-12-17         Pureleaf  beverages      152.89   \n",
       "45  2020-12-03   2020-12-17    Sauce - Salsa       food       96.20   \n",
       "46  2020-12-03   2020-12-17  Steampan - Foil       food      115.69   \n",
       "47  2020-12-03   2020-12-17         Rockstar  beverages      118.08   \n",
       "48  2020-12-03   2020-12-17      Spellagrino  beverages      187.82   \n",
       "\n",
       "         storeId  storeAddress  zipcode deliveredOnTime transactionStatus  \\\n",
       "44  homedelivery  homedelivery    82002              No          Approved   \n",
       "45  homedelivery  homedelivery    82002              No          Approved   \n",
       "46  homedelivery  homedelivery    58505             Yes          Disputed   \n",
       "47  homedelivery  homedelivery    11375             Yes          Approved   \n",
       "48  homedelivery  homedelivery    11375             Yes          Approved   \n",
       "\n",
       "    review  \n",
       "44       1  \n",
       "45       1  \n",
       "46       3  \n",
       "47       1  \n",
       "48       1  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data = pd.read_csv(r\"C:\\\\Users\\\\ms811\\\\Desktop\\\\groceryhub\\\\customerorders.csv\",encoding=\"ISO-8859-1\")\n",
    "data.tail()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from neo4j import GraphDatabase   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "     product_id            product_name     product_description  \\\n",
      "0             1      Sunflower Seed Raw           Carroway Seed   \n",
      "1             2           Sauce - Salsa  Lamb - Sausage Casings   \n",
      "2             4       Motts Apple Juice             Fresh Juice   \n",
      "3             5  Trout - Rainbow, Fresh    Sun - Dried Tomatoes   \n",
      "4             6             Lamb - Rack       Compound - Orange   \n",
      "..          ...                     ...                     ...   \n",
      "137         141      Seventh Generation         Kitchen Cleaner   \n",
      "138         142                Oxiclean  Washingmachine Cleaner   \n",
      "139         143            Simple Green      Industrial Cleaner   \n",
      "140         144                  Windex          Window Cleaner   \n",
      "141         146      Sunflower Seed Raw           Carroway Seed   \n",
      "\n",
      "     product_currentprice  product_discount  product_actualprice  \\\n",
      "0                  242.47                 9                  442   \n",
      "1                   96.20                 2                  486   \n",
      "2                  151.89                 9                  282   \n",
      "3                  264.25                 9                  438   \n",
      "4                  103.54                 1                  314   \n",
      "..                    ...               ...                  ...   \n",
      "137                 70.00                10                   63   \n",
      "138                 12.00                 0                   12   \n",
      "139                 10.00                 0                   10   \n",
      "140                  5.00                 5                    5   \n",
      "141                241.47                 9                  441   \n",
      "\n",
      "    product_category             product_image      product_manufacturer  \\\n",
      "0               food         images/food/1.png          Aufderhar-Schoen   \n",
      "1               food         images/food/2.jpg           Durgan and Sons   \n",
      "2               food         images/food/4.jpg               D'Amore LLC   \n",
      "3               food         images/food/5.jpg          Treutel-Baumbach   \n",
      "4               food        images/food/6.webp              Braun-Hansen   \n",
      "..               ...                       ...                       ...   \n",
      "137        household  /images/household/26.jpg              Welch-Sporer   \n",
      "138        household  /images/household/27.jpg               Hills-Sauer   \n",
      "139        household  /images/household/28.jpg              Mante-Spinka   \n",
      "140        household  /images/household/29.jpg  Pagac, Walsh and Friesen   \n",
      "141             food         images/food/1.png          Aufderhar-Schoen   \n",
      "\n",
      "     inventory  store_zipcode  rating  \n",
      "0           73          60601       5  \n",
      "1            9          41687       5  \n",
      "2           85          60235       5  \n",
      "3           53          85236       5  \n",
      "4           56          49652       5  \n",
      "..         ...            ...     ...  \n",
      "137         40          75632       5  \n",
      "138         77          15489       5  \n",
      "139         23          95478       5  \n",
      "140         77          84268       5  \n",
      "141         73          60616       5  \n",
      "\n",
      "[142 rows x 12 columns]\n"
     ]
    }
   ],
   "source": [
    "# Creating Product Nodes\n",
    "\n",
    "driver = GraphDatabase.driver(\"bolt://localhost\", auth=(\"neo4j\", \"csp584\"))\n",
    "data = pd.read_csv(\"C:\\\\Users\\\\ms811\\\\Desktop\\\\groceryhub\\\\groceryhub.csv\", encoding=\"ISO-8859-1\")\n",
    "\n",
    "data_category_range = data['product_name'].unique()\n",
    "data_category_range = data_category_range.tolist()\n",
    "\n",
    "for i,value in enumerate(data_category_range):\n",
    "    data[data['product_name'] == value].to_csv(r'product_name_'+str(value)+r'.csv',index = False, na_rep = 'N/A')\n",
    "print(data)\n",
    "\n",
    "with driver.session() as session:\n",
    "    deleteproducts = \"\"\" MATCH (n:Product) DETACH DELETE n \"\"\"\n",
    "    session.run(deleteproducts)\n",
    "    \n",
    "    cqlCreate = \"\"\" CREATE (p1:Product { Id:$Id, name:$name, productDescription:$productDescription, productCurrentPrice: $productCurrentPrice, productDiscount:$productDiscount, productActualPrice:$productActualPrice, productCategory:$productCategory, productManufacturer:$productManufacturer, productInventory:$productInventory, storeZipCode:$storeZipCode, rating:$rating}) \"\"\"\n",
    "    for each in range(len(data)):\n",
    "        \n",
    "        session.run(cqlCreate,number = each+1, Id = str(data.product_id[each]), name = str(data.product_name[each]), productDescription = str(data.product_description[each]), productCurrentPrice = str(data.product_currentprice[each]), productDiscount = str(data.product_discount[each]), productActualPrice = str(data.product_actualprice[each]), productCategory = str(data.product_category[each]), productManufacturer = str(data.product_manufacturer[each]), productInventory = str(data.inventory[each]), storeZipCode = str(data.store_zipcode[each]), rating = str(data.rating[each])) \n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                  user pass      usertype  zipcode              email\n",
      "0                    q    q      Customer    60616                  q\n",
      "1                    p    p  StoreManager    60616                  p\n",
      "2                    a    a      Customer    25478                  a\n",
      "3     Sainath Macharla    s      Customer    60616   fjeoe@lfojls.com\n",
      "4           Usain Bolt    u      Customer    78702    wsdth@fewaq.com\n",
      "5          Colby White    c      Customer     2115    xsert@mkiut.com\n",
      "6         Sharon Pinty    s      Customer    95101    mkiue@freyt.com\n",
      "7      Olivia Virginia    o      Customer    23231    asloe@grewq.com\n",
      "8        Patrick Llyod    p      Customer    19105    mherl@frmlp.com\n",
      "9          Amanda Suly    a      Customer    62544    mufgr@podmc.com\n",
      "10   George Washington    g      Customer    98274    mjuwq@nbfgr.com\n",
      "11        Walter White    w      Customer    87104     shurt@laor.com\n",
      "12        Gracy Staler    g      Customer    48219   orufnf@jfuek.com\n",
      "13     Samantha Norman    s      Customer    48105  kfhrto@fhreye.com\n",
      "14          Kurt Angle    k      Customer    29206   ugdye@lfdjrt.com\n",
      "15       Jesse Pinkman    j      Customer    87104    jurbx@koenv.com\n",
      "16         Colton Dorn    c      Customer    29606     micry@hfur.com\n",
      "17      Michael Fisher    m      Customer     2122     mufhr@gher.com\n",
      "18      Brandon Mayhew    b      Customer    87119    mcget@kghgl.com\n",
      "19           Pink Rose    p      Customer    98052     jfyr@gkrei.com\n",
      "20        Drape Husler    d      Customer    83735   jfyrg@fjfgif.com\n",
      "21            Bam Vibu    b      Customer    95532    ufhfk@lckfj.com\n",
      "22        Caesar North    c      Customer    60654   mcuiey@hxsga.com\n",
      "23  Giancarlo Esposito    g      Customer    94122   logfhr@tapof.com\n",
      "24          Juan Carlo    j      Customer    36879    akity@hteuw.com\n",
      "25           Don Pablo    d      Customer    83725  hfyurh@lcoerj.com\n",
      "26          John Smith    j      Customer    10471   yroldh@yakfo.com\n",
      "27        Randy Wilson    r      Customer    32211  ufhrh@lkfdifk.com\n",
      "28        Skinny Pette    s      Customer    32391   rwjdif@poadm.com\n",
      "29         Dormig Fred    d      Customer    33629     pocmd@hwye.com\n",
      "30         Lancer Ford    l      Customer    80219     ofhru@gkei.com\n",
      "31     Lance Armstrong    l      Customer    82002   irtyfh@lkshs.com\n",
      "32     Kristen Stewart    k      Customer    58505    igfmgh@hajd.com\n",
      "33        Peter Parker    p      Customer    11375  lhhske@hasgej.com\n"
     ]
    }
   ],
   "source": [
    "# Creating Customer nodes\n",
    "\n",
    "data = pd.read_csv(\"C:\\\\Users\\\\ms811\\\\Desktop\\\\groceryhub\\\\login.csv\", encoding=\"ISO-8859-1\")\n",
    "\n",
    "data_category_range = data['user'].unique()\n",
    "data_category_range = data_category_range.tolist()\n",
    "\n",
    "for i,value in enumerate(data_category_range):\n",
    "    data[data['user'] == value].to_csv(r'user_'+str(value)+r'.csv',index = False, na_rep = 'N/A')\n",
    "print(data)\n",
    "\n",
    "with driver.session() as session:\n",
    "    deleteCustomers = \"\"\" MATCH (n:Customer) DETACH  DELETE n \"\"\"\n",
    "    session.run(deleteCustomers)\n",
    "    cqlCreate = \"\"\" CREATE (c1:Customer { name: $name, zip: $zipcode, email: $email }) \"\"\"\n",
    "    for each in range(len(data)):\n",
    "        session.run(cqlCreate, number = each+1,name = str(data.user[each]), zipcode = str(data.zipcode[each]), email = str(data.email[each])) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [],
   "source": [
    "data = pd.read_csv(\"C:\\\\Users\\\\ms811\\\\Desktop\\\\groceryhub\\\\customerorders.csv\", encoding=\"ISO-8859-1\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'pandas.core.series.Series'>\n"
     ]
    }
   ],
   "source": [
    "# Making Relation between Customer and Products\n",
    "\n",
    "data = pd.read_csv(\"C:\\\\Users\\\\ms811\\\\Desktop\\\\groceryhub\\\\customerorders.csv\", encoding=\"ISO-8859-1\")\n",
    "\n",
    "data_category_range = data['userId'].unique()\n",
    "data_category_range = data_category_range.tolist()\n",
    "\n",
    "\n",
    "for i,value in enumerate(data_category_range):\n",
    "    data[data['userId'] == value].to_csv(r'userId_'+str(value)+r'.csv',index = False, na_rep = 'N/A')\n",
    "print(type(data.orderName))\n",
    " \n",
    "# for i in \n",
    "\n",
    "with driver.session() as session:\n",
    "    \n",
    "    cqlCreate= \"\"\" MATCH (a:Customer), (b:Product) WHERE a.name = $buyername AND b.name = $productbought CREATE (a)-[r:BOUGHT {id:$id ,name:$name, email:$email, userAddress:$userAddress, creditcardno:$creditcardno, discount:$discount, orderid:$orderid, ordertime:$ordertime, shipdate: $shipdate, productname:$productname, categoryname:$categoryname, price:$price, storeid:$storeid, storeaddress:$storeaddress, zipcode:$zipcode, deliveredontime:$deliveredontime, transactionstatus:$transactionstatus, reviewrating:$reviewrating, username:$username}]->(b) RETURN r \"\"\"    \n",
    "    for each in range(len(data)):\n",
    "        session.run(cqlCreate,buyername = str(data.customerName[each]),productbought = str(data.orderName[each]),id = str(data.userId[each]), name = str(data.customerName[each]), email = str(data.email[each]), userAddress = str(data.userAddress[each]), creditcardno = str(data.creditCardNo[each]), discount = str(data.discount[each]), orderid = str(data.orderId[each]), ordertime = str(data.orderTime[each]), shipdate = str(data.shippingDate[each]), productname= str(data.orderName[each]), categoryname = str(data.category[each]), price = str(data.orderPrice[each]), storeid = str(data.storeId[each]), storeaddress = str(data.storeAddress[each]), zipcode = str(data.zipcode[each]), deliveredontime = str(data.deliveredOnTime[each]), transactionstatus = str(data.transactionStatus[each]), reviewrating  = str(data.review[each]), username = str(data.username[each])) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#query 5\n",
    "\n",
    "# MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "# WHERE transaction.reviewrating = \"1\" and transaction.order_returned = \"True\"\n",
    "# WITH customer, count(*) AS number_of_transactions, transaction\n",
    "# WHERE number_of_transactions > 0\n",
    "# WITH customer,number_of_transactions,transaction\n",
    "# RETURN (customer.zip) AS zipcode ,count(number_of_transactions) as number_of_returned_orders ,transaction.categoryname as category\n",
    "\n",
    "# query 3\n",
    "\n",
    "# Get the top 3 customers that reported the maximum number of\n",
    "# returned orders \n",
    "#\n",
    "# MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "# WHERE transaction.order_returned= \"True\"\n",
    "# WITH customer, count(*) AS number_of_orders_returned\n",
    "# ORDER BY number_of_orders_returned DESC LIMIT 3\n",
    "# RETURN customer.name AS `Customer Name`, number_of_orders_returned\n",
    "\n",
    "# query 4\n",
    "\n",
    "# Get the number of disputed transactions for EVERY CUSTOMER that\n",
    "# has more that one disputed transaction \n",
    "# \n",
    "# MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "# WHERE transaction.transaction_status = \"disapproved\"\n",
    "# WITH customer, count(*) AS number_of_disputed_transactions\n",
    "# WHERE number_of_disputed_transactions > 1\n",
    "# RETURN customer.name AS Customer, number_of_disputed_transactions\n",
    "\n",
    "\n",
    "\n",
    "# query 2\n",
    "\n",
    "# Get the number of disputed transactions and the list of customer\n",
    "# names for these disputed transactions for Delivery Zip Code \n",
    "# \n",
    "# MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "#                 WHERE transaction.transaction_status = \"disapproved\"\n",
    "#                 WITH customer, product, transaction\n",
    "#                 RETURN customer.zip AS `zipcode`, count(transaction) AS Count,\n",
    "#                 collect(customer.name) AS Customers\n",
    "#                 ORDER BY Count DESC \n",
    "\n",
    "#query 1\n",
    "\n",
    "# MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "# WHERE transaction.actualdate > transaction.shipdate\n",
    "# WITH customer, count(*) AS number_of_late_delivery\n",
    "# WHERE number_of_late_delivery > 0\n",
    "# WITH customer,number_of_late_delivery\n",
    "# RETURN (customer.zip) AS zipcode , count(number_of_late_delivery)\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get the number of transactions that were NOT delivered on time for every Delivery Zip Code:\n",
      "\n",
      "Empty DataFrame\n",
      "Columns: []\n",
      "Index: []\n"
     ]
    }
   ],
   "source": [
    "from pandas import DataFrame\n",
    "\n",
    "print(\"Get the number of transactions that were NOT delivered on time for every Delivery Zip Code:\")\n",
    "print(\"\")\n",
    "with driver.session() as session:\n",
    "    query1 = \"\"\"MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "                WHERE transaction.transaction_status = \"Disputed\"\n",
    "                WITH customer, count(*) AS number_of_late_delivery\n",
    "                WHERE number_of_late_delivery > 0\n",
    "                WITH customer,number_of_late_delivery\n",
    "                RETURN (customer.zip) AS zipcode , count(number_of_late_delivery) as number_of_late_delivery\"\"\"\n",
    "    dtf_data = DataFrame([dict(_) for _ in session.run(query1)])\n",
    "    print(dtf_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get the number of disputed transactions and the list of customer names for these disputed transactions for Delivery Zip Code: \n",
      "\n"
     ]
    },
    {
     "ename": "CypherSyntaxError",
     "evalue": "{code: Neo.ClientError.Statement.SyntaxError} {message: Type mismatch: expected Boolean but was Map (line 2, column 37 (offset: 97))\r\n\"                WHERE customerorders{transactionStatus: \"Disputed\"}\"\r\n                                     ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-58-7eeadb96e4d7>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[0;32m      6\u001b[0m                 \u001b[0mWITH\u001b[0m \u001b[0mlogin\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mgroceryhub\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mcustomerorders\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      7\u001b[0m                 RETURN login.user\"\"\"\n\u001b[1;32m----> 8\u001b[1;33m     \u001b[0mdtf_data\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mDataFrame\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m[\u001b[0m\u001b[0mdict\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0m_\u001b[0m\u001b[1;33m)\u001b[0m \u001b[1;32mfor\u001b[0m \u001b[0m_\u001b[0m \u001b[1;32min\u001b[0m \u001b[0msession\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mquery2\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      9\u001b[0m     \u001b[0mprint\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mdtf_data\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\neo4j\\work\\simple.py\u001b[0m in \u001b[0;36mrun\u001b[1;34m(self, query, parameters, **kwparameters)\u001b[0m\n\u001b[0;32m    215\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    216\u001b[0m         \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_autoResult\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mResult\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mcx\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mhydrant\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mfetch_size\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_result_closed\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 217\u001b[1;33m         \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_autoResult\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_run\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdatabase\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdefault_access_mode\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_bookmarks\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    218\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    219\u001b[0m         \u001b[1;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_autoResult\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\neo4j\\work\\result.py\u001b[0m in \u001b[0;36m_run\u001b[1;34m(self, query, parameters, db, access_mode, bookmarks, **kwparameters)\u001b[0m\n\u001b[0;32m     99\u001b[0m         \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_pull\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    100\u001b[0m         \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0msend_all\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 101\u001b[1;33m         \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_attach\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    102\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    103\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0m_pull\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\neo4j\\work\\result.py\u001b[0m in \u001b[0;36m_attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    200\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_closed\u001b[0m \u001b[1;32mis\u001b[0m \u001b[1;32mFalse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    201\u001b[0m             \u001b[1;32mwhile\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_attached\u001b[0m \u001b[1;32mis\u001b[0m \u001b[1;32mFalse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 202\u001b[1;33m                 \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mfetch_message\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    203\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    204\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0m_buffer_all\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\neo4j\\io\\_bolt4.py\u001b[0m in \u001b[0;36mfetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    361\u001b[0m             \u001b[0mlog\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdebug\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"[#%04X]  S: FAILURE %r\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mlocal_port\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0msummary_metadata\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    362\u001b[0m             \u001b[1;32mtry\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 363\u001b[1;33m                 \u001b[0mresponse\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mon_failure\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0msummary_metadata\u001b[0m \u001b[1;32mor\u001b[0m \u001b[1;33m{\u001b[0m\u001b[1;33m}\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    364\u001b[0m             \u001b[1;32mexcept\u001b[0m \u001b[1;33m(\u001b[0m\u001b[0mServiceUnavailable\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mDatabaseUnavailable\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    365\u001b[0m                 \u001b[1;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mpool\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\neo4j\\io\\_common.py\u001b[0m in \u001b[0;36mon_failure\u001b[1;34m(self, metadata)\u001b[0m\n\u001b[0;32m    177\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    178\u001b[0m             \u001b[0mhandler\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 179\u001b[1;33m         \u001b[1;32mraise\u001b[0m \u001b[0mNeo4jError\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m**\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    180\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    181\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0mon_ignored\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mmetadata\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;32mNone\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: Type mismatch: expected Boolean but was Map (line 2, column 37 (offset: 97))\r\n\"                WHERE customerorders{transactionStatus: \"Disputed\"}\"\r\n                                     ^}"
     ]
    }
   ],
   "source": [
    "print(\"Get the number of disputed transactions and the list of customer names for these disputed transactions for Delivery Zip Code: \")\n",
    "print(\"\")\n",
    "with driver.session() as session:\n",
    "    query2 = \"\"\"MATCH (login:Customer)-[customerorders:BOUGHT]->(groceryhub)\n",
    "                WHERE customerorders.transactionStatus = \"Disputed\"\n",
    "                WITH login, groceryhub, customerorders\n",
    "                RETURN login.user\"\"\"\n",
    "    dtf_data = DataFrame([dict(_) for _ in session.run(query2)])\n",
    "    print(dtf_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get the number of disputed transactions for EVERY CUSTOMER that has more that one disputed transaction: \n",
      "\n",
      "  Customer  number_of_disputed_transactions\n",
      "0   test16                                2\n"
     ]
    }
   ],
   "source": [
    "print(\"Get the number of disputed transactions for EVERY CUSTOMER that has more that one disputed transaction: \")\n",
    "print(\"\")\n",
    "with driver.session() as session:\n",
    "    query3 = \"\"\"MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "                WHERE transaction.transaction_status = \"disapproved\"\n",
    "                WITH customer, count(*) AS number_of_disputed_transactions\n",
    "                WHERE number_of_disputed_transactions > 1\n",
    "                RETURN customer.name AS Customer, number_of_disputed_transactions\"\"\"\n",
    "    dtf_data = DataFrame([dict(_) for _ in session.run(query3)])\n",
    "    print(dtf_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get the top 3 customers that reported the maximum number of returned orders\n",
      "\n",
      "  Customer Name  number_of_orders_returned\n",
      "0         test9                          2\n",
      "1         test3                          1\n",
      "2         test2                          1\n"
     ]
    }
   ],
   "source": [
    "print(\"Get the top 3 customers that reported the maximum number of returned orders\")\n",
    "print(\"\")\n",
    "with driver.session() as session:\n",
    "    query4 = \"\"\"MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "                WHERE transaction.order_returned= \"True\"\n",
    "                WITH customer, count(*) AS number_of_orders_returned\n",
    "                ORDER BY number_of_orders_returned DESC LIMIT 3\n",
    "                RETURN customer.name AS `Customer Name`, number_of_orders_returned\"\"\"\n",
    "    dtf_data = DataFrame([dict(_) for _ in session.run(query4)])\n",
    "    print(dtf_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Get the number of returned orders and got review rating 1 for every product category in every Delivery Zip Code \n",
      "\n",
      "    zipcode  number_of_returned_orders        category\n",
      "0   60616.0                          2  fitnesswatches\n",
      "1    7890.0                          1       headphone\n",
      "2   45678.0                          1    Smartwatches\n",
      "3  349870.0                          1  fitnesswatches\n"
     ]
    }
   ],
   "source": [
    "print(\"Get the number of returned orders and got review rating 1 for every product category in every Delivery Zip Code \")\n",
    "print(\"\")\n",
    "with driver.session() as session:\n",
    "    query5 = \"\"\"MATCH (customer:Customer)-[transaction:BOUGHT]->(product)\n",
    "                WHERE transaction.reviewrating = \"1\" and transaction.order_returned = \"True\"\n",
    "                WITH customer, count(*) AS number_of_transactions, transaction\n",
    "                WHERE number_of_transactions > 0\n",
    "                WITH customer,number_of_transactions,transaction\n",
    "                RETURN (customer.zip) AS zipcode ,count(number_of_transactions) as number_of_returned_orders ,transaction.categoryname as category\"\"\"\n",
    "    dtf_data = DataFrame([dict(_) for _ in session.run(query5)])\n",
    "    print(dtf_data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}